Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes Constructor (DimensionSetBaseAttributes.Placings, PlacingDirectionAttributes, PlacingDistanceAttributes)
 Creates a new dimension placing attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionPlacingAttributes(
	DimensionSetBaseAttributes.Placings placing,
	PlacingDirectionAttributes direction,
	PlacingDistanceAttributes distance
)
Public Sub New (
	placing As DimensionSetBaseAttributes.Placings,
	direction As PlacingDirectionAttributes,
	distance As PlacingDistanceAttributes
)
Parameters
placing
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placings
The placing type of the dimension.
direction
Type: Tekla.Structures.Drawing.PlacingDirectionAttributes
The placing direction attributes of the dimension.
distance
Type: Tekla.Structures.Drawing.PlacingDistanceAttributes
The placing distance attributes of the dimension.
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
DimensionSetBaseAttributes.DimensionPlacingAttributes Overload
Tekla.Structures.Drawing Namespace